demonstracoes/c#/bin/Debug/Templates/vm60/MG/pedido_inutilizarnf.soap

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:nfe="http://www.portalfiscal.inf.br/nfe/wsdl/NFeInutilizacao4"><soap:Header/><soap:Body><nfe:nfeDadosMsg>%s</nfe:nfeDadosMsg></soap:Body></soap:Envelope>